export const entities = [
  "عضو محافظة",
  "وحدة العمل الجماهيري",
  "وحدة التواصل الطلابي",
  "وحدة التواصل الشبابي",
  "وحدة التدريبات الشبابية",
  "وحدة المسؤولية الاجتماعية CSR",
  "وحدة المرأة",
  "وحدة المواطنة",
  "وحدة ذوي الهمم",
  "وحدة السياسات",
  "وحدة التنمية المجتمعية",
  "وحدة شؤون التعليم والبحث العلمي",
  "وحدة التخطيط والتطوير الإستراتيجي",
  "وحدة التنمية الثقافية",
  "لجنة الادارة التنفيذية",
  "وحدة المتابعة",
  "وحدة التنمية السياحية والآثرية",
  "وحدة العلاقات العامة",
  "وحدة الحوكمة",
  "وحدة العلاقات الحكومية",
  "وحدة شباب المصريين بالخارج",
  "وحدة التسويق",
  "وحدة المبادرات",
  "وحدة الصحة والسكان",
  "وحدة الملتقيات الشبابية المحلية",
  "وحدة المعلومات والتحول الرقمي",
  "وحدة الشؤون القانونية",
  "وحدة شباب المهنيين",
  "وحدة التنمية الرياضية",
  "وحدة التنمية الاقتصادية",
  "وحدة التنمية المستدامة",
  "وحدة البيئة والطاقة",
  "وحدة القيم",
  "وحدة الربط المركزي",
  "وحدة التنمية المحلية",
  "وحدة العضوية",
  "المركز الإعلامي",
  "مركز تعزيز",
  "مركز ارتقاء",
  "مركز اكتيفيتي",
  "مركز استجابه",
] as const;

export type Entity = (typeof entities)[number];

export const memberTypes = [
  { value: "student", label: "طالب" },
  { value: "graduate", label: "خريج" },
] as const;

export type MemberType = "student" | "graduate";

export const membershipFees = {
  student: 10,
  graduate: 1000,
} as const;

export const paymentInfo = {
  accountNumber: "10010373638701037",
  studentFee: "10 جنيه",
  graduateFee: "1000 جنيه",
} as const;
